Revit 2024 API
DirectContext3DHandleSettings.Visibility Property
 Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool Visibility { get; set; }
Visual Basic
Public Property Visibility As Boolean
	Get
	Set
Visual C++
public:
property bool Visibility {
	bool get ();
	void set (bool value);
}
See Also
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace